# Emulation
cask 'chiaki'
cask 'dolphin'
cask 'moonlight'
brew 'ppsspp'

# If there is already an application installed, the cask variant will download but it will not overwrite existing installations.

# Personal Apps
cask '1password'
cask 'airtable'
cask 'arduino-ide'
cask 'cardhop'
cask 'coolterm'
cask 'discord'
cask 'dropbox'
cask 'eagle'
cask 'fantastical'
cask 'mqtt-explorer'
cask 'mullvadvpn'
cask 'nextcloud'
cask 'notion'
cask 'parsec'
cask 'prusaslicer'
cask 'roon'
cask 'sketch'
cask 'steam'
cask 'syncthing'
cask 'tailscale'
cask 'ticktick'
cask 'transmission'
cask 'ultimaker-cura'

# Mac App Store
mas 'Aiko', id: 1672085276
mas 'Blackmagic Disc Speed Test', id: 425264550
mas 'Drafts', id: 1435957248
mas 'Dark Noise: Ambient Sounds', id: 1465439395
mas 'Flighty – Live Flight Tracker', id: 1358823008
mas 'Hand Mirror', id: 1502839586
mas 'Paprika', id: 1303222628
mas 'Speedtest', id: 1153157709
mas 'Xcode', id: 497799835