# Binaries
brew 'bash' # Latest Bash version
brew 'chezmoi'
brew 'colima'
brew 'coreutils' # Those that come with macOS are outdated
brew 'dfu-util'
brew 'docker'
brew 'docker-buildx' # Fixed case
brew 'docker-compose'
brew 'ffmpeg'
brew 'flac'
# brew 'fprobe' # Removed: use ffprobe (included in ffmpeg)
brew 'git'
brew 'grep'
brew 'jenv'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'maven'
brew 'mosh'
brew 'ncdu'
brew 'node'
brew 'ollama'
# brew 'opencode' # Check this name; likely 'opencore-configurator' or similar
brew 'orbstack'
brew 'pandoc'
brew 'pdf-diff'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'pipx'
brew 'pyenv'
brew 'speedtest-cli'
brew 'svn' # Needed to install fonts
brew 'tree'
brew 'yt-dlp'

# Fonts - Homebrew now prefers the 'font-' prefix from the default cask tap
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'

# Core Apps
cask 'android-studio'
cask 'arc'
cask 'atext'
cask 'balenaetcher'
cask 'betterdisplay'
cask 'bitwarden'
cask 'cheatsheet'
cask 'firefox'
cask 'ghostty'
cask 'iterm2'
cask 'lm-studio'
cask 'jordanbaird-ice'
cask 'obsidian'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'vlc'
cask 'yubico-authenticator'
cask 'zen-browser'
cask 'zoom'